// Array compress
// Написать программу, которая сжимает серии массива, состоящего из единиц и нулей
//  по следующему принципу, например:

// массив [0,0,0,0,1,1,1,1,1,1,1,0,0,1,1,1,1] преобразуется в [4,7,2,4]
// массив [0,0,1,1,1,1,0,1,1,1] преобразуется в [2,4,1,3]

var arr1 = [0,0,0,0,1,1,1,1,1,1,1,0,0,1,1,1,1];
var arr2 = [0,0,1,1,1,1,0,1,1,1];

function compressArray(x){

    var a = [1];

    for ( var i = 1; i < x.length; i++){
        if (x[i] === x[i-1]){
            a[a.length - 1] += 1;
        } else {
            a.push(1);
        }
    }

    return a;
}
alert (compressArray(arr1));
alert (compressArray(arr2));